# Exercises I

# Run python -m pip install pymysql from your terminal to install the mysql client (any folder is fine)

# cd into your exercises folder for this module and run echo env.py >> .gitignore

# Create a function named get_db_url. It should accept a username, hostname, password, and database name and return a url connection string formatted like in the example at the start of this lesson.

In [1]:
# get a url from a user, password, host and database
user = "neo"
password = "follow_the_white_rabbit"
host = "matrix_incubation_pod_11379"
database = "the_one"

url = f'mysql+pymysql://{user}:{password}@{host}/{database}'
url

'mysql+pymysql://neo:follow_the_white_rabbit@matrix_incubation_pod_11379/the_one'

In [2]:
# convert code into a function
def get_db_url(user,password,host,database):
    '''get a url from input user, password, host and database'''
    
    return f'mysql+pymysql://{user}:{password}@{host}/{database}'

In [3]:
# testing the function
user = "neo"
password = "follow_the_white_rabbit"
host = "matrix_incubation_pod_11379"
database = "the_one"

get_db_url(user,password,host,database)

'mysql+pymysql://neo:follow_the_white_rabbit@matrix_incubation_pod_11379/the_one'

# Use your function to obtain a connection to the employees database.

In [4]:
import pandas as pd
from env import user, password, host

# enter query as a variable
query = "select * from employees"

# get url from function
url = get_db_url(user, password, host, 'employees')

# get dataframe from query and url using read_sql
pd.read_sql(query, url)

        emp_no  birth_date first_name last_name gender   hire_date
0        10001  1953-09-02     Georgi   Facello      M  1986-06-26
1        10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2        10003  1959-12-03      Parto   Bamford      M  1986-08-28
3        10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4        10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12
...        ...         ...        ...       ...    ...         ...
300019  499995  1958-09-24     Dekang  Lichtner      F  1993-01-12
300020  499996  1953-03-07       Zito      Baaz      M  1990-09-27
300021  499997  1961-08-03    Berhard    Lenart      M  1986-04-21
300022  499998  1956-09-05   Patricia   Breugel      M  1993-10-13
300023  499999  1958-05-01     Sachin   Tsukuda      M  1997-11-30

[300024 rows x 6 columns]

In [5]:
# refactored get_db_url to return a dataframe based on inputs
def get_data_from_sql(user, host, password, database, query):
    '''
    take in user, host, password, 
    database and query
    Access sql database
    return a pandas dataframe of the query results   
    '''
    # get url from input 
    url = f'mysql+pymysql://{user}:{password}@{host}/{database}'
        
    # return dataframe of query using read_sql
    return pd.read_sql(query, url)

In [6]:
# testing function

query = '''

select * from employees

'''

df = get_data_from_sql(user, host, password, "employees", query)

df.head(10)

   emp_no  birth_date first_name  last_name gender   hire_date
0   10001  1953-09-02     Georgi    Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel     Simmel      F  1985-11-21
2   10003  1959-12-03      Parto    Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian    Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi   Maliniak      M  1989-09-12
5   10006  1953-04-20     Anneke    Preusig      F  1989-06-02
6   10007  1957-05-23    Tzvetan  Zielinski      F  1989-02-10
7   10008  1958-02-19     Saniya   Kalloufi      M  1994-09-15
8   10009  1952-04-19     Sumant       Peac      F  1985-02-18
9   10010  1963-06-01  Duangkaew   Piveteau      F  1989-08-24

# Once you have successfully run a query:

# a. Intentionally make a typo in the database url. What kind of error message do you see?

In [7]:
# # making a typo in the user name results in an access denied message
# url = f'mysql+pymysql://{user}ERROR:{password}@{host}/employees'
        
# pd.read_sql(query, url)

# b. Intentionally make an error in your SQL query. What does the error message look like?

In [8]:
# # making an error in your sql syntax will result in a sql syntax error
# url = f'mysql+pymysql://{user}:{password}@{host}/employees'
    
# query = "select ** from employees"
        
# pd.read_sql(query, url)

# Read the employees and titles tables into two separate DataFrames.

In [9]:
# getting employees data from sql server using the get_data_from_sql
employees = get_data_from_sql(user, host, password, 'employees', 'select * from employees')
employees.head()

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

In [10]:
# getting titles data from sql server using the get_data_from_sql
titles = get_data_from_sql(user, host, password, 'employees', 'select * from titles')
titles.head()

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01

# How many rows and columns do you have in each DataFrame? Is that what you expected?

In [11]:
employees.shape

(300024, 6)

In [12]:
titles.shape

(443308, 4)

# Display the summary statistics for each DataFrame.

In [13]:
employees.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300024 entries, 0 to 300023
Data columns (total 6 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   emp_no      300024 non-null  int64
 1   birth_date  300024 non-null  object
 2   first_name  300024 non-null  object
 3   last_name   300024 non-null  object
 4   gender      300024 non-null  object
 5   hire_date   300024 non-null  object
dtypes: int64(1), object(5)
memory usage: 13.7+ MB

In [14]:
employees.describe()

              emp_no
count  300024.000000
mean   253321.763392
std    161828.235540
min     10001.000000
25%     85006.750000
50%    249987.500000
75%    424993.250000
max    499999.000000

In [15]:
titles.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 443308 entries, 0 to 443307
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   emp_no     443308 non-null  int64
 1   title      443308 non-null  object
 2   from_date  443308 non-null  object
 3   to_date    443308 non-null  object
dtypes: int64(1), object(3)
memory usage: 13.5+ MB

In [16]:
titles.describe()

              emp_no
count  443308.000000
mean   253075.034430
std    161853.292613
min     10001.000000
25%     84855.750000
50%    249847.500000
75%    424891.250000
max    499999.000000

# How many unique titles are in the titles DataFrame?

In [17]:
# get count of values in a column using value_counts
titles.title.value_counts()

Engineer              115003
Staff                 107391
Senior Engineer        97750
Senior Staff           92853
Technique Leader       15159
Assistant Engineer     15128
Manager                   24
Name: title, dtype: int64

In [18]:
# get number of unique values by getting length of value_counts of the column 
len(titles.title.value_counts())

7

# What is the oldest date in the to_date column?

In [19]:
# passing ascending = False will cause the values in value counts to sort in descending order
titles.to_date.sort_values(ascending=False)

0         9999-01-01
251516    9999-01-01
251529    9999-01-01
251528    9999-01-01
251526    9999-01-01
             ...
277603    1985-04-17
35527     1985-03-23
346216    1985-03-20
406358    1985-03-11
16064     1985-03-01
Name: to_date, Length: 443308, dtype: object

In [20]:
# using head one will show only the value at the top of the value sort
titles.to_date.sort_values(ascending=False).head(1)

0    9999-01-01
Name: to_date, dtype: object

# What is the most recent date in the to_date column?

In [21]:
# sort values in to_date in ascending order display the top value
titles.to_date.sort_values(ascending=True).head(1)

16064    1985-03-01
Name: to_date, dtype: object

# Exercises II

# Copy the users and roles DataFrames from the examples above.

In [22]:
import numpy as np

In [23]:
# create dataframe using dictionary
users = pd.DataFrame({
                        'id': [1, 2, 3, 4, 5, 6],
                        'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
                        'role_id': [1, 2, 3, 3, np.nan, np.nan]
                     })
users

   id   name  role_id
0   1    bob      1.0
1   2    joe      2.0
2   3  sally      3.0
3   4   adam      3.0
4   5   jane      NaN
5   6   mike      NaN

In [24]:
# create dataframe using dictionary
roles = pd.DataFrame({
                        'id': [1, 2, 3, 4],
                        'name': ['admin', 'author', 'reviewer', 'commenter']
                    })
roles

   id       name
0   1      admin
1   2     author
2   3   reviewer
3   4  commenter

# What is the result of using a right join on the DataFrames?

In [25]:
# right merge users and roles using the role_id and id 
pd.merge(users, roles, left_on='role_id', right_on='id', how='right')

   id_x name_x  role_id  id_y     name_y
0   1.0    bob      1.0     1      admin
1   2.0    joe      2.0     2     author
2   3.0  sally      3.0     3   reviewer
3   4.0   adam      3.0     3   reviewer
4   NaN    NaN      NaN     4  commenter

* If columns have matching names they are renamed adding _x or _y depending on which dataframe they came from
* All rows on the right dataframe are kept
* If a row on the left dataframe matches a row on the right dataframe they are combined into one row
* If a row on the left dataframe does not match a row on the right dataframe it is discarded 
* If a row on the right dataframe does not match a row on the left dataframe the row is added to the new dataframe and null values are placed in the columns from the right dataframe
* rows are matching if they contain the same value for the columns designated left_on and right_on

# What is the result of using an outer join on the DataFrames?

In [26]:
# outer merging the users and roles tables on the role_id and id columns
pd.merge(users, roles, left_on='role_id', right_on='id', how='outer')

   id_x name_x  role_id  id_y     name_y
0   1.0    bob      1.0   1.0      admin
1   2.0    joe      2.0   2.0     author
2   3.0  sally      3.0   3.0   reviewer
3   4.0   adam      3.0   3.0   reviewer
4   5.0   jane      NaN   NaN        NaN
5   6.0   mike      NaN   NaN        NaN
6   NaN    NaN      NaN   4.0  commenter

* If columns have matching names they are renamed adding _x or _y depending on which table they came from
* All rows are kept
* Rows that match are combined into one row 
* Rows that do not match are added to the new dataframe and nulls are put into columns where values are missing

# What happens if you drop the foreign keys from the DataFrames and try to merge them

* Foreign keys are a collumn or set of columns that allow us to establish a referential link between the data in two tables
* Without Foreign keys to link the dataframes together, merging them is impossible

# Load the mpg dataset from PyDataset.

In [27]:
import pydataset
from pydataset import data

# save mpg data as mpg
mpg = data('mpg')

# Output and read the documentation for the mpg dataset.

In [28]:
# read out documentation for mpg data
pydataset.data('mpg', show_doc=True)

mpg

PyDataset Documentation (adopted from R Documentation. The displayed examples are in R)

## Fuel economy data from 1999 and 2008 for 38 popular models of car

### Description

This dataset contains a subset of the fuel economy data that the EPA makes
available on http://fueleconomy.gov. It contains only models which had a new
release every year between 1999 and 2008 - this was used as a proxy for the
popularity of the car.

### Usage

    data(mpg)

### Format

A data frame with 234 rows and 11 variables

### Details

  * manufacturer.

  * model.

  * displ. engine displacement, in litres

  * year.

  * cyl. number of cylinders

  * trans. type of transmission

  * drv. f = front-wheel drive, r = rear wheel drive, 4 = 4wd

  * cty. city miles per gallon

  * hwy. highway miles per gallon

  * fl.

  * class.

# How many rows and columns are in the dataset?

In [29]:
mpg.shape

(234, 11)

# Check out your column names and perform any cleanup you may want on them.

In [30]:
mpg.columns

Index(['manufacturer', 'model', 'displ', 'year', 'cyl', 'trans', 'drv', 'cty',
       'hwy', 'fl', 'class'],
      dtype='object')

In [31]:
# rename columns using .rename
mpg = mpg.rename(columns={'cty':'cty_mpg', 'hwy':'hwy_mpg'})

mpg.head()

,manufacturer,model,displ,year,cyl,trans,drv,cty_mpg,hwy_mpg,fl,class
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact

# Display the summary statistics for the dataset.

In [32]:
mpg.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 234 entries, 1 to 234
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   manufacturer  234 non-null    object
 1   model         234 non-null    object
 2   displ         234 non-null    float64
 3   year          234 non-null    int64
 4   cyl           234 non-null    int64
 5   trans         234 non-null    object
 6   drv           234 non-null    object
 7   cty_mpg       234 non-null    int64
 8   hwy_mpg       234 non-null    int64
 9   fl            234 non-null    object
 10  class         234 non-null    object
dtypes: float64(1), int64(4), object(6)
memory usage: 21.9+ KB

In [33]:
mpg.describe()

            displ         year         cyl     cty_mpg     hwy_mpg
count  234.000000   234.000000  234.000000  234.000000  234.000000
mean     3.471795  2003.500000    5.888889   16.858974   23.440171
std      1.291959     4.509646    1.611534    4.255946    5.954643
min      1.600000  1999.000000    4.000000    9.000000   12.000000
25%      2.400000  1999.000000    4.000000   14.000000   18.000000
50%      3.300000  2003.500000    6.000000   17.000000   24.000000
75%      4.600000  2008.000000    8.000000   19.000000   27.000000
max      7.000000  2008.000000    8.000000   35.000000   44.000000

# How many different manufacturers are there?

In [34]:
mpg.manufacturer.value_counts()

dodge         37
toyota        34
volkswagen    27
ford          25
chevrolet     19
audi          18
hyundai       14
subaru        14
nissan        13
honda          9
jeep           8
pontiac        5
land rover     4
mercury        4
lincoln        3
Name: manufacturer, dtype: int64

In [35]:
len(mpg.manufacturer.value_counts())

15

# How many different models are there?

In [36]:
mpg.model.value_counts()

caravan 2wd               11
ram 1500 pickup 4wd       10
jetta                      9
civic                      9
mustang                    9
dakota pickup 4wd          9
a4 quattro                 8
grand cherokee 4wd         8
impreza awd                8
a4                         7
passat                     7
tiburon                    7
durango 4wd                7
camry                      7
sonata                     7
toyota tacoma 4wd          7
f150 pickup 4wd            7
camry solara               7
altima                     6
4runner 4wd                6
forester awd               6
new beetle                 6
explorer 4wd               6
corvette                   5
malibu                     5
gti                        5
grand prix                 5
c1500 suburban 2wd         5
corolla                    5
range rover                4
mountaineer 4wd            4
k1500 tahoe 4wd            4
pathfinder 4wd             4
navigator 2wd              3
a6 quattro                 3
maxima                     3
expedition 2wd             3
land cruiser wagon 4wd     2
Name: model, dtype: int64

In [37]:
len(mpg.model.value_counts())

38

# Create a column named mileage_difference like you did in the DataFrames exercises; this column should contain the difference between highway and city mileage for each car.

In [38]:
# get new column mileage_difference by subtracting cty_mpg from hwy_mpg
mpg['mileage_difference'] = mpg.hwy_mpg - mpg.cty_mpg

In [39]:
mpg.head()

,manufacturer,model,displ,year,cyl,trans,drv,cty_mpg,hwy_mpg,fl,class,mileage_difference
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10

# Create a column named average_mileage like you did in the DataFrames exercises; this is the mean of the city and highway mileage.

In [40]:
# create new column average_mileage by summing hwy_mpg and cty_mpg, and dividing the result by two
mpg['average_mileage'] = (mpg.hwy_mpg + mpg.cty_mpg) / 2

In [41]:
mpg.head()

,manufacturer,model,displ,year,cyl,trans,drv,cty_mpg,hwy_mpg,fl,class,mileage_difference,average_mileage
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25.0
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,25.5
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25.5
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21.0

# Create a new column on the mpg dataset named is_automatic that holds boolean values denoting whether the car has an automatic transmission.

In [42]:
# inspect values in trans
mpg.trans.value_counts()

auto(l4)      83
manual(m5)    58
auto(l5)      39
manual(m6)    19
auto(s6)      16
auto(l6)       6
auto(av)       5
auto(s5)       3
auto(s4)       3
auto(l3)       2
Name: trans, dtype: int64

In [43]:
# create new column is_automatic by checking weather the first character in each value in trans is 'a.' 
mpg['is_automatic'] = mpg.trans.apply(lambda value : value[0] == 'a')

In [44]:
mpg.sample(10)

,manufacturer,model,displ,year,cyl,trans,drv,cty_mpg,hwy_mpg,fl,class,mileage_difference,average_mileage,is_automatic
206,toyota,toyota tacoma 4wd,4.0,2008,6,manual(m6),4,15,18,r,pickup,3,16.5,False
208,volkswagen,gti,2.0,1999,4,manual(m5),f,21,29,r,compact,8,25.0,False
46,dodge,caravan 2wd,3.8,1999,6,auto(l4),f,15,21,r,minivan,6,18.0,True
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25.0,False
115,hyundai,sonata,3.3,2008,6,auto(l5),f,19,28,r,midsize,9,23.5,True
69,dodge,ram 1500 pickup 4wd,4.7,2008,8,manual(m6),4,12,16,r,pickup,4,14.0,False
101,honda,civic,1.6,1999,4,auto(l4),f,24,32,r,subcompact,8,28.0,True
28,chevrolet,corvette,7.0,2008,8,manual(m6),r,15,24,p,2seater,9,19.5,False
53,dodge,dakota pickup 4wd,4.7,2008,8,auto(l5),4,14,19,r,pickup,5,16.5,True
6,audi,a4,2.8,1999,6,manual(m5),f,18,26,p,compact,8,22.0,False

# Using the mpg dataset, find out which which manufacturer has the best miles per gallon on average?

In [45]:
# what do I want to compare
mpg.groupby('manufacturer')

In [46]:
# what will I use to compare them 
mpg.groupby('manufacturer').average_mileage

In [47]:
# how will I aggragate the data
mpg.groupby('manufacturer').average_mileage.agg('mean')

manufacturer
audi          22.027778
chevrolet     18.447368
dodge         15.540541
ford          16.680000
honda         28.500000
hyundai       22.750000
jeep          15.562500
land rover    14.000000
lincoln       14.166667
mercury       15.625000
nissan        21.346154
pontiac       21.700000
subaru        22.428571
toyota        21.720588
volkswagen    25.074074
Name: average_mileage, dtype: float64

In [48]:
# what part of the data do I want to show
mpg.groupby('manufacturer').average_mileage.agg('mean').sort_values().tail(1)

manufacturer
honda    28.5
Name: average_mileage, dtype: float64

In [49]:
# group by manufacturer comparing the mean of average_milage, sort those values and display the last one 
mpg.groupby('manufacturer').average_mileage.agg('mean').sort_values().tail(1)

manufacturer
honda    28.5
Name: average_mileage, dtype: float64

# Do automatic or manual cars have better miles per gallon?

In [50]:
# what do I want to compare
mpg.groupby('is_automatic')

In [51]:
# what will I use to compare them 
mpg.groupby('is_automatic').average_mileage

In [52]:
# how will I aggragate the data
mpg.groupby('is_automatic').average_mileage.agg('mean')

is_automatic
False    22.227273
True     19.130573
Name: average_mileage, dtype: float64

In [53]:
# group by is_automatic and compare the values using the mean of average_milage
mpg.groupby('is_automatic').average_mileage.agg('mean')

is_automatic
False    22.227273
True     19.130573
Name: average_mileage, dtype: float64

# Exercises III

# Use your get_db_url function to help you explore the data from the chipotle database.

In [54]:
# function from earlier
def get_data_from_sql(user, host, password, database, query):
    '''
    take in user, host, password, 
    database and query
    Access sql database
    return a pandas dataframe of the query results   
    '''
    
    # get url from function inputs
    url = f'mysql+pymysql://{user}:{password}@{host}/{database}'
    
    # get dataframe from query and url using read_sql 
    return pd.read_sql(query, url)

In [55]:
# using function to get data from chipolte database  
df = get_data_from_sql(user, host, password, 'chipotle', 'select * from orders')
df.head()

,id,order_id,quantity,item_name,choice_description,item_price
0,1,1,1,Chips and Fresh Tomato Salsa,nan,$2.39
1,2,1,1,Izze,[Clementine],$3.39
2,3,1,1,Nantucket Nectar,[Apple],$3.39
3,4,1,1,Chips and Tomatillo-Green Chili Salsa,nan,$2.39
4,5,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans, Rice, Cheese, Sour Cream]]",$16.98

# What is the total price for each order?

In [56]:
# group by order id 
df.groupby('order_id')

In [57]:
# group by order id using item price to compare them
df.groupby('order_id').item_price

In [58]:
# group by order id using the sum of item price to compare them
# Shows error if not cleaned properly
df.groupby('order_id').item_price.agg('sum')

order_id
1       $2.39 $3.39 $3.39 $2.39
2                        $16.98
3                  $10.98 $1.69
4                  $11.75 $9.25
5                   $9.25 $4.45
                  ...
1830              $11.75 $11.25
1831          $9.25 $2.15 $1.50
1832                $8.75 $4.45
1833              $11.75 $11.75
1834         $11.25 $8.75 $8.75
Name: item_price, Length: 1834, dtype: object

In [59]:
# applies lambda to values in item_price 
# lambda removes the first chatacter and leading and trailing white space in the string
# it then converts the value to a float

df['item_price'] = df.item_price.apply(lambda value: float(value[1:].strip()))

In [60]:
df.head()

,id,order_id,quantity,item_name,choice_description,item_price
0,1,1,1,Chips and Fresh Tomato Salsa,nan,2.39
1,2,1,1,Izze,[Clementine],3.39
2,3,1,1,Nantucket Nectar,[Apple],3.39
3,4,1,1,Chips and Tomatillo-Green Chili Salsa,nan,2.39
4,5,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans, Rice, Cheese, Sour Cream]]",16.98

In [61]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   id                  4622 non-null   int64
 1   order_id            4622 non-null   int64
 2   quantity            4622 non-null   int64
 3   item_name           4622 non-null   object
 4   choice_description  4622 non-null   object
 5   item_price          4622 non-null   float64
dtypes: float64(1), int64(3), object(2)
memory usage: 216.8+ KB

In [62]:
df.head()

,id,order_id,quantity,item_name,choice_description,item_price
0,1,1,1,Chips and Fresh Tomato Salsa,nan,2.39
1,2,1,1,Izze,[Clementine],3.39
2,3,1,1,Nantucket Nectar,[Apple],3.39
3,4,1,1,Chips and Tomatillo-Green Chili Salsa,nan,2.39
4,5,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans, Rice, Cheese, Sour Cream]]",16.98

In [63]:
# group by order_id using the sum of item price to compare the groups
df.groupby('order_id').item_price.agg('sum')

order_id
1       11.56
2       16.98
3       12.67
4       21.00
5       13.70
        ...
1830    23.00
1831    12.90
1832    13.20
1833    23.50
1834    28.75
Name: item_price, Length: 1834, dtype: float64

# What are the most popular 3 items?

In [64]:
# group by item_name using the sum of quantity to compare the groups
# sorting in decending order and only showing the top three items
df.groupby('item_name').quantity.agg('sum').sort_values(ascending=False).head(3)

item_name
Chicken Bowl           761
Chicken Burrito        591
Chips and Guacamole    506
Name: quantity, dtype: int64

# Which item has produced the most revenue?

In [66]:
# group by item_name using the sum of item_price to compare the groups
# sort values in decending order and displaying only the top  
df.groupby('item_name').item_price.agg('sum').sort_values(ascending=False).head(1)

item_name
Chicken Bowl    7342.73
Name: item_price, dtype: float64

# Join the employees and titles DataFrames together.

In [67]:
# get inner join of employees and titles joining on emp_no for both
employee_titles = pd.merge(employees, titles, left_on='emp_no', right_on='emp_no', how='inner')
employee_titles

,emp_no,birth_date,first_name,last_name,gender,hire_date,title,from_date,to_date
0,10001,1953-09-02,Georgi,Facello,M,1986-06-26,Senior Engineer,1986-06-26,9999-01-01
1,10002,1964-06-02,Bezalel,Simmel,F,1985-11-21,Staff,1996-08-03,9999-01-01
2,10003,1959-12-03,Parto,Bamford,M,1986-08-28,Senior Engineer,1995-12-03,9999-01-01
3,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,Engineer,1986-12-01,1995-12-01
4,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,Senior Engineer,1995-12-01,9999-01-01
...,...,...,...,...,...,...,...,...,...
443303,499997,1961-08-03,Berhard,Lenart,M,1986-04-21,Engineer,1987-08-30,1992-08-29
443304,499997,1961-08-03,Berhard,Lenart,M,1986-04-21,Senior Engineer,1992-08-29,9999-01-01
443305,499998,1956-09-05,Patricia,Breugel,M,1993-10-13,Senior Staff,1998-12-27,9999-01-01
443306,499998,1956-09-05,Patricia,Breugel,M,1993-10-13,Staff,1993-12-27,1998-12-27
443307,499999,1958-05-01,Sachin,Tsukuda,M,1997-11-30,Engineer,1997-11-30,9999-01-01

# For each title, find the hire date of the employee that was hired most recently with that title.

In [68]:
# group by title using hire_date to compare them aggegating by the max 
employee_titles.groupby('title').hire_date.agg('max')

title
Assistant Engineer    1999-12-24
Engineer              2000-01-28
Manager               1992-02-05
Senior Engineer       2000-01-01
Senior Staff          2000-01-13
Staff                 2000-01-12
Technique Leader      1999-12-31
Name: hire_date, dtype: object

# Write the code necessary to create a cross tabulation of the number of titles by department. (Hint: this will involve a combination of SQL code to pull the necessary data and python/pandas code to perform the manipulations.)

In [69]:
query = '''

SELECT emp_no, title, dept_name

FROM employees
JOIN titles USING(emp_no)
JOIN dept_emp USING(emp_no)
JOIN departments USING(dept_no)

where titles.to_date = "9999-01-01"

'''

df = get_data_from_sql(user, host, password, 'employees', query)

df.head()

   emp_no            title        dept_name
0   10001  Senior Engineer      Development
1   10002            Staff            Sales
2   10003  Senior Engineer       Production
3   10004  Senior Engineer       Production
4   10005     Senior Staff  Human Resources

In [70]:
# get crosstab of title and dept_name column
pd.crosstab(df.title, df.dept_name)

dept_name,Customer Service,Development,Finance,Human Resources,Marketing,Production,Quality Management,Research,Sales
title,,,,,,,,,
Assistant Engineer,68,1833,0,0,0,1542,433,77,0
Engineer,627,15677,0,0,0,13325,3744,830,0
Manager,1,1,1,1,1,1,1,1,1
Senior Engineer,1790,43364,0,0,0,37156,10390,2250,0
Senior Staff,12349,1085,10650,10843,12371,1123,0,10219,32032
Staff,3902,315,3199,3416,3880,349,0,3206,9967
Technique Leader,241,6117,0,0,0,5210,1422,321,0